---
type: Rectangle
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# Rectangle

`Autodesk.Revit.DB.Rectangle` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | Rectangle | — | `` |
| Constructor | Rectangle | 2014 | `public Rectangle ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | IsNormalized | 2014 | `public bool IsNormalized ()` |
| Property | Bottom | 2014 | `public int Bottom { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Left | 2014 | `public int Left { get ; set ; }` |
| Property | Right | 2014 | `public int Right { get ; set ; }` |
| Property | Top | 2014 | `public int Top { get ; set ; }` |